<template>
  <div class="bg-box wh-full">
    <NavBar showLogo />
    <div class="
      fixed
      w-111rem
      h-111rem
      rounded-50%
      bottom--60rem
      left--35rem
      bg-[rgba(241,143,219,0.21)]">
    </div>

    <div class="
      fixed
      w-42rem
      h-42rem
      rounded-50%
      top--12rem
      right-15.9rem
      bg-[rgba(241,143,219,0.21)]">
    </div>
    <div class="
      w-108rem
      h-72rem
      max-w-1080px
      max-h-720px
      bg-white
      rounded-24px
      mt-18rem
      sm:mt-10rem
      mb-18rem
      shadow-lg 
      shadow-[rgba(219,175,201,0.45)]
      overflow-hidden
      flex-shrink-0
      ">
      <div class="flex flex-col-start wh-full relative bg-white">
        <div class="text-2.4rem font-600 mt-2.4rem line-height-normal">隐私协议</div>
        <div class="absolute right-4rem top-4rem z-999 cursor-pointer" @click="goBack">
          <Image name="icon24_close.svg" class="w-2.4rem h-2.4rem" />
        </div>
        <div class="absolute left-4rem top-4rem z-999 cursor-pointer" @click="goBack">
          <Image name="icon24_arrow_left.svg" class="w-2.4rem h-2.4rem" />
        </div>

        <div class="overflow-auto mx-4rem mt-3.2rem rounded-8px bg-#F5F5F5">
          <article class="px-2.4rem py-2.4rem font-400 text-14px">
            <h3>引言</h3>

            <p>白小喵AI（以下简称“本软件”）是由深圳光启计算科技有限公司（以下简称“我们”或“光启计算”）为用户（以下或简称“您”）提供的产品及服务。我们重视用户个人信息的保护，根据《中华人民共和国网络安全法》等相关法律法规制定本政策并保护您的个人信息安全。我们希望通过本政策向您说明您的哪些信息可能会被收集、收集这些信息的目的、我们及您如何保护这些信息的安全。</p>
            <p>请您在使用本软件前，仔细阅读本政策（尤其是加粗的内容）并确认了解我们对您个人信息的处理规则。如您对本政策有任何疑问，可联系我们进行咨询。</p>
            <p>我们如何收集和使用您的个人信息</p>
            <p>个人信息是指以电子或其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。个人信息包括姓名、出生日期、通信通讯联系方式、通信记录和内容、账号密码、征信信息、行踪轨迹、住宿信息、健康生理信息、交易信息等。</p>
            <p>个人敏感信息包括身份证件号码、个人生物识别信息、银行账号、通信记录和内容、财产信息、征信信息、行踪轨迹、住宿信息、健康生理信息、交易信息、14岁以下（含）儿童的个人信息等。本政策有关个人信息、个人敏感信息的内容出自于GB/T35273《个人信息安全规范》的规定，定义与GB/T35273《个人信息安全规范》定义一致。对个人敏感信息，我们用“加粗斜体”的书写方式进行特别提醒，希望您在阅读时特别关注。</p>
            
            <p>光启计算收集个人信息的主要来源有：您向光启计算提供的信息、光启计算在您使用本软件过程中获取的信息。光启计算会出于如下产品功能之目的，收集和使用您的个人信息，如您不提供相关信息或不同意白小喵AI收集相关信息，您可能无法注册成为我们的用户或无法享受我们提供的某些服务，或无法达到好的服务效果。</p>
            
            <p>1.为注册账户或第三方授权登录之目的收集您提供的信息</p>
            <p>1.1 为向您提供账号注册、登录功能及服务，在您通过以下方式注册或登录本软件时，您需要提供如下账号注册信息：</p>
            <p>第三方跳转登录：您可以使用第三方账号登录，主要是微信账号，当您授权使用前述第三方账号登录时，我们会收集从第三方账号共享的头像、昵称及其他您在第三方授权登录界面同意授予的信息。</p>
            <p>收集前述这些账号信息的目的在于（1）通过账号管理更好地为您提供服务，通过登录账户，您可以同步您的文档数据；在您更换设备后，通过登录账户，可以继续使用您已同步的相关信息，不会因为更换设备而导致数据丢失。（2）如您提供真实有效的手机号码、微信号进行绑定，当您遇到注册账号丢失、忘记密码问题时，可以便捷的找回账号和密码。</p>
            <p>1.2 如您不提供上述信息，不注册账号，将可能会影响您使用本软件的如下功能：机器对话及文档编辑等功能。</p>
            <p>2.向您提供产品或服务之目的</p>
            <p>为向您提供更能满足您需求的对话服务，了解产品适配性、识别账号异常状态、向您报送错误，除了您根据产品或服务内容主动向我们提供的信息外，我们会直接或间接收集关于您使用本软件的如下相关信息。具体如下：</p>
            <p>2.1 设备信息</p>
            <p>设备信息，是指您使用本软件时使用的设备的信息。</p>
            <p>为了使本软件与设备进行必要的适配并安全服务，您在使用本软件时，根据您在软件安装及使用中授予的具体权限，光启计算会收集您的设备品牌、设备型号、屏幕分辨率、设备识别码（IMEI、Android
            id）、系统版本、IP地址。收集这些信息是为了向您提供更契合您需求的页面展示和搜索结果、了解产品适配性、识别账号异常状态、向您报送错误、进行bug分析，保障您正常使用本软件的服务、改进和优化我们的产品体验、保障您的账号安全。光启计算不会将该等信息与您的个人身份信息进行匹配，同时，除本政策另有明确约定外，光启计算也不会将您的设备信息提供给任何第三方。但光启计算无法保证其他第三方不会通过其他途径获知您设备信息、并将设备信息与其他信息相结合识别您个人身份的情况，由此造成您任何损失的，您应向该第三方追偿。上述设备信息是为提供服务所收集的基础信息，如您不想设备信息被光启计算收集，则可能导致我们无法向您提供正常的服务。</p>
            <p>2.2 日志信息</p>
            <p>为了保障网络安全，改进和优化产品功能，您使用本软件时，系统可能通过cookies或其他方式自动收集某些信息并存储在服务器日志中。光启计算收集的此类信息可能包括：</p>
            <p>1）对本软件的相关使用情况：您使用本软件的版本号、网络状态、您对本软件的设置项信息、您对本软件的浏览&操作行为，该类数据都是匿名的，光启计算不会对该等信息进行一一匹配、也不会与您的个人身份信息进行匹配。</p>
            <p>2）网络安全事件相关日志信息，包括系统崩溃、系统活动信息。此类信息为法律规定要求收集的信息，如您不想此等信息被光启计算收集，则请您不要使用本软件。
            请您注意单独的设备信息、日志信息等无法识别特定自然人身份，为了在您使用设备上为您提供一致的服务，我们可能会将您各种设备上收集的相关信息进行关联。如果该等关联导致可以识别特定自然人身份的，则除非获得您的授权或同意，否则我们会将该类信息作匿名化、去标识化处理后进行使用。</p>
            
            <p></p>
            <p></p>
            <p></p>
            <p></p>
            <p></p>
            <p></p>
            <p></p>
            

            
            
            
            
            
            
            2.3 文本信息
            在您使用白小喵AI时，本软件需要获取您输入相关文本信息并完成机器持续学习，以便为您提供更好角色对话服务。在您使用机器对话功能时，本软件需要获取您输入的文本信息并完成对话内容生成，以方便为您提供机器对话服务。系统将对您的对话信息与您的个人信息进行隐私计算，后台无法获得对话内容对应的个人信息，该类数据都是匿名的，光启计算不会对该等信息进行一一匹配、也不会与您的个人身份信息进行匹配。
            2.4 进程信息
            当您使用白小喵AI时，我们需要获取您在运行中的进程信息，具体是获取手机中是否安装微信。此信息用于在使用微信快捷登录、微信分享时，若手机中没有安装微信提供错误处理。
            为了给您提供更准确，本软件会按照本隐私权政策的规定使用和披露您的个人信息。但本软件将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，本软件不会将这些信息对外披露或向第三方提供。本软件会不时更新本隐私权政策。您在同意本软件服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私权政策属于本软件服务使用协议不可分割的一部分。
            一、适用范围
            在您使用本软件网络服务，本软件自动接收并记录的您的手机上的信息，包括但不限于您的使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据。

            二、信息披露
            1.本软件不会将您的信息披露给不受信任的第三方
            2.根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露
            3.公开披露个人信息时事先征得授权同意的例外

            以下情形中，公开披露您的个人信息时，无需事先征得您的授权同意：
            （1）与国家安全、国防安全有关的；
            （2）与公共安全、公共卫生、重大公共利益有关的；
            （3）与犯罪侦查、起诉、审判和判决执行等有关的；
            （4）出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
            （5）您自行向社会公众公开的个人信息；
            （6）从合法公开披露的信息中收集个人信息的，比如合法的新闻报道、政府信息公开等渠道。
            （7）根据法律规定，共享、转让经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露的行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。
          </article>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
const router = useRouter();

const goBack = () => {
  router.go(-1);
}
</script>
