<script setup>
import X from "~/login/x.png";
import Back from "~/login/back.png";

const props = defineProps({
  category: {
    type: String,
  },
});

const emit = defineEmits(["handleBackEmit"]);

const handleBack = () => {
  emit("handleBackEmit");
};
</script>

<template>
  <div class="xy-comp">
    <div class="header">
      <img :src="Back" alt="" @click="handleBack" />
      {{ props.category === "1" ? "用户协议" : "隐私政策" }}
      <img :src="X" alt="" @click="handleBack" />
    </div>

    <div class="container" v-if="props.category === '1'">
      <div class="normal">
        白小喵AI是一款以人工智能为基础的产品，主要功能为通过聊天和游戏化的方式进行情绪测评，帮助用户缓解压力、焦虑、抑郁等症状。虽然白小喵AI能够提供测评和疏导的功能，但它不能替代专业的心理咨询或医疗服务。如果您有或者怀疑自己有任何心理或者精神类疾病症状，请在第一时间寻求专业医师的帮助。
        为使用白小喵的服务（以下简称“本服务”），您应当阅读并遵守《白小喵用户服务协议》（以下简称"本协议"）。请您务必审慎阅读、充分理解各条款内容，如果您未满18周岁，或者不具备完全民事行为能力，请在法定监护人的陪同下阅读本协议，否则本服务及所属深圳光启计算科技有限公司对您所发生的不利后果不承担责任，并有权在知晓情况后解除双方间的服务协议。
      </div>

      <div class="item">
        <div class="bold">一、协议范围</div>
        <div class="normal">
          本协议是您与深圳光启计算科技有限公司之间，关于使用深圳光启计算有限公司旗下白小喵AI产品相关服务所订立的协议。
        </div>
      </div>

      <div class="item">
        <div class="bold">二、使用声明与免责声明</div>
        <div class="normal">
          2.1
          您应当理解并同意本协议相关条款，同时您使用本服务即视为接受本协议及后续更新。
          2.2
          本服务仅用于向您一对一输出内容，不意味着所输出的内容代表本服务及深圳光启计算科技有限公司的观点或自然具有公开属性。
          2.3
          在使用本产品之前请确保您无心理和精神类疾病、无自杀倾向且已满18周岁。
          2.4
          非医疗和心理咨询服务：白小喵AI不能诊断、治疗、缓解或预防任何形式的心理或精神疾病。白小喵AI不是一个医疗或心理咨询设备，也不是一个医疗或心理咨询服务的替代品。如果您怀疑自己可能患有心理或精神疾病，或者您已被诊断为心理或精神疾病，或您有自杀倾向，我们强烈建议您立即寻求专业医生或心理咨询师的帮助。
          2.4
          内容的准确性：我们已经尽力确保白小喵AI的内容和建议的准确性，但是，我们不能保证这些内容和建议完全准确或适用于所有人。白小喵AI的所有内容和建议都是根据一般情况提供的，可能不适用于特定个人的具体情况。
          2.5
          风险和责任：用户完全理解并同意，使用白小喵AI的所有风险由用户自己承担。我们对因使用或无法使用白小喵AI而导致的任何直接、间接、附带、特殊、惩罚性或后果性的损害均不承担责任，包括但不限于身体伤害、情绪困扰或任何其他形式的不适。
          2.6
          用户的责任：用户理解并同意，在使用白小喵AI的同时，用户应继续接受专业医疗人员的建议和治疗。用户有责任确保自己的行为符合医生或其他专业医疗人员的建议。
          2.7
          白小喵无法对用户通过白小喵AI服务上传的内容进行预先知晓并合理控制，因此，您应该预料到在使用白小喵的服务时可能会接触到一些可能令您觉得不悦、不适的内容。在此情况下，您同意放弃对白小喵进行任何索赔。
          2.8
          您确认并知悉当前白小喵基于服务生成的所有内容都是由人工智能模型生成，我们对其生成内容的准确性、完整性不作任何保证，并且其生成的内容不代表白小喵的态度和观点。我们的服务来自于法律法规允许的包括但不限于公开互联网等信息积累，已经过不断地自动及人工敏感数据过滤，但仍不排除其中部分内容仍有瑕疵。
          2.9
          若因不当传播，或自行书写不当内容后明示或暗示为本服务输出内容给深圳光启计算科技有限公司造成损失的，公司将采用法律手段维权。
          3.0
          如违反本协议规定，深圳光启计算科技有限公司有权中止服务和通过法律手段维权。
        </div>
      </div>

      <div class="item">
        <div class="bold">三、法律声明</div>
        <div class="normal">
          3.1. 本协议的订立、执行和解释及争议的解决均适用中华人民共和国法律。
          3.2
          禁止涉及或传播淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的内容。
          3.3
          禁止涉及或传播损害国家荣誉和利益的、煽动民族仇恨、民族歧视，破坏民族团结的、破坏国家宗教政策，宣扬邪教、封建迷信或违背社会公序良俗的内容。
          3.4 禁止涉及或传播可能损害公众人物、功勋人物、英烈的内容。 3.5
          禁止涉及或传播可能损害第三方版权的内容。 3.6
          禁止涉及或传播侮辱、诽谤他人，侵害他人合法权益的内容。 3.7
          禁止涉及或传播散布谣言，扰乱社会秩序，破坏社会稳定的内容。 3.8
          禁止涉及或传播法律、行政法规和国家规定禁止的内容。
          3.9禁止诱导白小喵输出上述3.2-3.8禁止涉及或传播的相关内容。
        </div>
      </div>

      <div class="item">
        <div class="bold">四、知识产权声明</div>
        <div class="normal">
          4.1
          如果您认为白小喵作出的贡献足够显著，在公开发表包含本服务输出的内容时，希望您能署名“白小喵”。这样可以帮助您更快地找到志同道合者，与他们一起进行想法和灵感的碰撞，共同建设
          AI
          续写这个崭新的领域。但我们并不强制要求您进行署名。为了最大程度保证用户自由创作和分享作品的权利，我们愿意把
          AI 创作内容的版权给予用户。 4.2
          您输入白小喵的内容应当符合该内容的著作权声明，不得违反与输入内容相关的著作权约定，不得侵犯他人著作权。
          4.3 未经书面同意，不得对本服务进行反向工程、反向编译或破解。
        </div>
      </div>

      <div class="item">
        <div class="bold">五、其它</div>
        <div class="normal">
          7.1
          本条款因与中华人民共和国现行法律相抵触而导致部分无效，不影响其他部分的效力。双方同意，解决争议时，应以您同意的最新版《白小喵用户协议》为准。
          7.2
          如就本协议内容或其执行发生任何争议，应尽量友好协商解决；协商不成时，则争议各方均一致同意将争议提交北京仲裁委员会按照其仲裁规则进行仲裁。仲裁裁决为一裁终局，对各方均有法律约束力。
          7.3
          为免疑义，除另有相反书面约定外，本条法律适用和管辖条款效力及于本协议及其他白小喵AI规则，包括其修订、补充及更新。
          7.4 如果您对本协议有任何疑问，请发送邮件到我们的邮箱:
        </div>
      </div>

      <div class="item">深圳光启科技有限公司</div>
      <div class="item">2023年3月</div>
    </div>

    <div class="container" v-if="props.category === '2'">
      <div class="item" style="margin-top: 0">
        <div class="bold">引言</div>
        <div class="normal">
          白小喵AI（以下简称“本软件”）是由深圳光启计算科技有限公司（以下简称“我们”或“光启计算”）为用户（以下或简称“您”）提供的产品及服务。我们重视用户个人信息的保护，根据《中华人民共和国网络安全法》等相关法律法规制定本政策并保护您的个人信息安全。我们希望通过本政策向您说明您的哪些信息可能会被收集、收集这些信息的目的、我们及您如何保护这些信息的安全。
          请您在使用本软件前，仔细阅读本政策（尤其是加粗的内容）并确认了解我们对您个人信息的处理规则。如您对本政策有任何疑问，可联系我们进行咨询。
        </div>
      </div>

      <div class="item">
        <div class="bold">我们如何收集和使用您的个人信息</div>
        <div class="normal">
          个人信息是指以电子或其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。个人信息包括姓名、出生日期、通信通讯联系方式、通信记录和内容、账号密码、征信信息、行踪轨迹、住宿信息、健康生理信息、交易信息等。
          个人敏感信息包括身份证件号码、个人生物识别信息、银行账号、通信记录和内容、财产信息、征信信息、行踪轨迹、住宿信息、健康生理信息、交易信息、14岁以下（含）儿童的个人信息等。本政策有关个人信息、个人敏感信息的内容出自于GB/T35273《个人信息安全规范》的规定，定义与GB/T35273《个人信息安全规范》定义一致。对个人敏感信息，我们用“加粗斜体”的书写方式进行特别提醒，希望您在阅读时特别关注。
          光启计算收集个人信息的主要来源有：您向光启计算提供的信息、光启计算在您使用本软件过程中获取的信息。光启计算会出于如下产品功能之目的，收集和使用您的个人信息，如您不提供相关信息或不同意白小喵AI收集相关信息，您可能无法注册成为我们的用户或无法享受我们提供的某些服务，或无法达到好的服务效果。
        </div>
      </div>

      <div class="item">
        <div class="bold">为注册账户或第三方授权登录之目的收集您提供的信息</div>
        <div class="normal">
          1.
          为向您提供账号注册、登录功能及服务，在您通过以下方式注册或登录本软件时，您需要提供如下账号注册信息：
          第三方跳转登录：您可以使用第三方账号登录，主要是微信账号，当您授权使用前述第三方账号登录时，我们会收集从第三方账号共享的头像、昵称及其他您在第三方授权登录界面同意授予的信息。
          收集前述这些账号信息的目的在于（1）通过账号管理更好地为您提供服务，通过登录账户，您可以同步您的文档数据；在您更换设备后，通过登录账户，可以继续使用您已同步的相关信息，不会因为更换设备而导致数据丢失。（2）如您提供真实有效的手机号码、微信号进行绑定，当您遇到注册账号丢失、忘记密码问题时，可以便捷的找回账号和密码。
          2.
          如您不提供上述信息，不注册账号，将可能会影响您使用本软件的如下功能：机器对话及文档编辑等功能。
        </div>
      </div>

      <div class="item">
        <div class="bold">向您提供产品或服务之目的</div>
        <div class="normal">
          为向您提供更能满足您需求的对话服务，了解产品适配性、识别账号异常状态、向您报送错误，除了您根据产品或服务内容主动向我们提供的信息外，我们会直接或间接收集关于您使用本软件的如下相关信息。具体如下：
        </div>
        <div class="normal">
          1. 设备信息 设备信息，是指您使用本软件时使用的设备的信息。
          为了使本软件与设备进行必要的适配并安全服务，您在使用本软件时，根据您在软件安装及使用中授予的具体权限，光启计算会收集您的设备品牌、设备型号、屏幕分辨率、设备识别码（IMEI、Android
          id）、系统版本、IP地址。收集这些信息是为了向您提供更契合您需求的页面展示和搜索结果、了解产品适配性、识别账号异常状态、向您报送错误、进行bug分析，保障您正常使用本软件的服务、改进和优化我们的产品体验、保障您的账号安全。光启计算不会将该等信息与您的个人身份信息进行匹配，同时，除本政策另有明确约定外，光启计算也不会将您的设备信息提供给任何第三方。但光启计算无法保证其他第三方不会通过其他途径获知您设备信息、并将设备信息与其他信息相结合识别您个人身份的情况，由此造成您任何损失的，您应向该第三方追偿。上述设备信息是为提供服务所收集的基础信息，如您不想设备信息被光启计算收集，则可能导致我们无法向您提供正常的服务。
        </div>
        <div class="normal">
          2. 日志信息
          为了保障网络安全，改进和优化产品功能，您使用本软件时，系统可能通过cookies或其他方式自动收集某些信息并存储在服务器日志中。光启计算收集的此类信息可能包括：
          1）对本软件的相关使用情况：您使用本软件的版本号、网络状态、您对本软件的设置项信息、您对本软件的浏览&操作行为，该类数据都是匿名的，光启计算不会对该等信息进行一一匹配、也不会与您的个人身份信息进行匹配。
          2）网络安全事件相关日志信息，包括系统崩溃、系统活动信息。此类信息为法律规定要求收集的信息，如您不想此等信息被光启计算收集，则请您不要使用本软件。
          请您注意单独的设备信息、日志信息等无法识别特定自然人身份，为了在您使用设备上为您提供一致的服务，我们可能会将您各种设备上收集的相关信息进行关联。如果该等关联导致可以识别特定自然人身份的，则除非获得您的授权或同意，否则我们会将该类信息作匿名化、去标识化处理后进行使用。
        </div>
        <div class="normal">
          3. 文本信息
          在您使用白小喵AI时，本软件需要获取您输入相关文本信息并完成机器持续学习，以便为您提供更好角色对话服务。在您使用机器对话功能时，本软件需要获取您输入的文本信息并完成对话内容生成，以方便为您提供机器对话服务。系统将对您的对话信息与您的个人信息进行隐私计算，后台无法获得对话内容对应的个人信息，该类数据都是匿名的，光启计算不会对该等信息进行一一匹配、也不会与您的个人身份信息进行匹配。
          2.4 进程信息
          当您使用白小喵AI时，我们需要获取您在运行中的进程信息，具体是获取手机中是否安装微信。此信息用于在使用微信快捷登录、微信分享时，若手机中没有安装微信提供错误处理。
          为了给您提供更准确，本软件会按照本隐私权政策的规定使用和披露您的个人信息。但本软件将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，本软件不会将这些信息对外披露或向第三方提供。本软件会不时更新本隐私权政策。您在同意本软件服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私权政策属于本软件服务使用协议不可分割的一部分。
          一、适用范围
          在您使用本软件网络服务，本软件自动接收并记录的您的手机上的信息，包括但不限于您的使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据。
          二、信息披露 1.本软件不会将您的信息披露给不受信任的第三方
          2.根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露
          3.公开披露个人信息时事先征得授权同意的例外
          以下情形中，公开披露您的个人信息时，无需事先征得您的授权同意：
          （1）与国家安全、国防安全有关的；
          （2）与公共安全、公共卫生、重大公共利益有关的；
          （3）与犯罪侦查、起诉、审判和判决执行等有关的；
          （4）出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
          （5）您自行向社会公众公开的个人信息；
          （6）从合法公开披露的信息中收集个人信息的，比如合法的新闻报道、政府信息公开等渠道。
          （7）根据法律规定，共享、转让经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露的行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。
        </div>
      </div>
    </div>
  </div>
</template>

<style scoped lang="scss">
.xy-comp {
  height: calc(100vh - 12rem);
  background-color: #fff;
  width: 100vw;
  position: absolute;
  left: -2.4rem;
  top: -2rem;
  box-shadow: 0px -3px 7px 0px rgba(162, 117, 152, 0.25);
  border-top-left-radius: 1.6rem;
  border-top-right-radius: 1.6rem;

  .header {
    height: 6rem;
    display: flex;
    align-items: center;
    justify-content: space-between;
    color: rgba(0, 0, 0, 1);
    font-size: 1.6rem;
    font-weight: 600;
    padding: 0 2.4rem;

    img {
      width: 2.4rem;
      height: 2.4rem;
    }
  }

  .container {
    height: calc(100% - 6rem);
    overflow-y: auto;
    padding: 2.4rem;
    background-color: rgba(245, 245, 245, 1);
    font-size: 1.2rem;

    .item {
      margin-top: 3rem;
    }

    .normal {
      line-height: 2rem;
      margin-bottom: 1rem;
    }

    .bold {
      font-weight: 700;
      font-size: 1.4rem;
      margin-bottom: 0.8rem;
    }
  }
}
</style>
