<template>
  <div class="
  w-108rem
  max-w-1080px
  max-h-72rem
  h-[calc(100%-88px)]
bg-white
  rounded-24px
  mt-56px
shadow-lg
shadow-[rgba(219,175,201,0.45)]
  overflow-hidden
  flex-shrink-0
  ">
    <div class="flex flex-col-start wh-full relative bg-white rounded-24px overflow-hidden">
      <div class="text-2.4rem font-600 mt-2.4rem line-height-normal">用户协议</div>
      <div class="w-24px h-24px absolute right-4rem top-4rem z-999 cursor-pointer" @click="goBack">
        <SvgImage name="icon24_close.svg" class="w-2.4rem h-2.4rem" />
      </div>
      <div class="w-24px h-24px absolute left-4rem top-4rem z-999 cursor-pointer" @click="goBack">
        <SvgImage name="icon_arrow_left.svg" class="w-2.4rem h-2.4rem" />
      </div>

      <div class="overflow-auto mx-4rem mt-3.2rem rounded-8px bg-#F5F5F5">
        <article class="article">
          <p>
            白小喵AI是一款以人工智能为基础的产品，主要功能为通过聊天和游戏化的方式进行情绪测评，帮助用户缓解压力、焦虑、抑郁等症状。虽然白小喵AI能够提供测评和疏导的功能，但它不能替代专业的心理咨询或医疗服务。如果您有或者怀疑自己有任何心理或者精神类疾病症状，请在第一时间寻求专业医师的帮助。
            为使用白小喵的服务（以下简称“本服务”），您应当阅读并遵守《白小喵用户服务协议》（以下简称"本协议"）。请您务必审慎阅读、充分理解各条款内容，如果您未满18周岁，或者不具备完全民事行为能力，请在法定监护人的陪同下阅读本协议，否则本服务及所属深圳光启计算科技有限公司对您所发生的不利后果不承担责任，并有权在知晓情况后解除双方间的服务协议。
          </p>
          <h3>一、协议范围</h3>

          <p>本协议是您与深圳光启计算科技有限公司之间，关于使用深圳光启计算有限公司旗下白小喵AI产品相关服务所订立的协议。</p>

          <h3>二、使用声明与免责声明</h3>
          <p>2.1 您应当理解并同意本协议相关条款，同时您使用本服务即视为接受本协议及后续更新。
            2.2 本服务仅用于向您一对一输出内容，不意味着所输出的内容代表本服务及深圳光启计算科技有限公司的观点或自然具有公开属性。
            2.3 在使用本产品之前请确保您无心理和精神类疾病、无自杀倾向且已满18周岁。
            2.4
            非医疗和心理咨询服务：白小喵AI不能诊断、治疗、缓解或预防任何形式的心理或精神疾病。白小喵AI不是一个医疗或心理咨询设备，也不是一个医疗或心理咨询服务的替代品。如果您怀疑自己可能患有心理或精神疾病，或者您已被诊断为心理或精神疾病，或您有自杀倾向，我们强烈建议您立即寻求专业医生或心理咨询师的帮助。
            2.4 内容的准确性：我们已经尽力确保白小喵AI的内容和建议的准确性，但是，我们不能保证这些内容和建议完全准确或适用于所有人。白小喵AI的所有内容和建议都是根据一般情况提供的，可能不适用于特定个人的具体情况。
            2.5
            风险和责任：用户完全理解并同意，使用白小喵AI的所有风险由用户自己承担。我们对因使用或无法使用白小喵AI而导致的任何直接、间接、附带、特殊、惩罚性或后果性的损害均不承担责任，包括但不限于身体伤害、情绪困扰或任何其他形式的不适。
            2.6 用户的责任：用户理解并同意，在使用白小喵AI的同时，用户应继续接受专业医疗人员的建议和治疗。用户有责任确保自己的行为符合医生或其他专业医疗人员的建议。
            2.7 白小喵无法对用户通过白小喵AI服务上传的内容进行预先知晓并合理控制，因此，您应该预料到在使用白小喵的服务时可能会接触到一些可能令您觉得不悦、不适的内容。在此情况下，您同意放弃对白小喵进行任何索赔。
            2.8
            您确认并知悉当前白小喵基于服务生成的所有内容都是由人工智能模型生成，我们对其生成内容的准确性、完整性不作任何保证，并且其生成的内容不代表白小喵的态度和观点。我们的服务来自于法律法规允许的包括但不限于公开互联网等信息积累，已经过不断地自动及人工敏感数据过滤，但仍不排除其中部分内容仍有瑕疵。
            2.9 若因不当传播，或自行书写不当内容后明示或暗示为本服务输出内容给深圳光启计算科技有限公司造成损失的，公司将采用法律手段维权。
            3.0 如违反本协议规定，深圳光启计算科技有限公司有权中止服务和通过法律手段维权。</p>
          <h3>三、法律声明</h3>

          <p>3.1. 本协议的订立、执行和解释及争议的解决均适用中华人民共和国法律。
            3.2 禁止涉及或传播淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的内容。
            3.3 禁止涉及或传播损害国家荣誉和利益的、煽动民族仇恨、民族歧视，破坏民族团结的、破坏国家宗教政策，宣扬邪教、封建迷信或违背社会公序良俗的内容。
            3.4 禁止涉及或传播可能损害公众人物、功勋人物、英烈的内容。
            3.5 禁止涉及或传播可能损害第三方版权的内容。
            3.6 禁止涉及或传播侮辱、诽谤他人，侵害他人合法权益的内容。
            3.7 禁止涉及或传播散布谣言，扰乱社会秩序，破坏社会稳定的内容。
            3.8 禁止涉及或传播法律、行政法规和国家规定禁止的内容。
            3.9禁止诱导白小喵输出上述3.2-3.8禁止涉及或传播的相关内容。</p>

          <h3>四、知识产权声明</h3>
          <p>4.1 如果您认为白小喵作出的贡献足够显著，在公开发表包含本服务输出的内容时，希望您能署名“白小喵”。这样可以帮助您更快地找到志同道合者，与他们一起进行想法和灵感的碰撞，共同建设 AI
            续写这个崭新的领域。但我们并不强制要求您进行署名。为了最大程度保证用户自由创作和分享作品的权利，我们愿意把 AI 创作内容的版权给予用户。
            4.2 您输入白小喵的内容应当符合该内容的著作权声明，不得违反与输入内容相关的著作权约定，不得侵犯他人著作权。
            4.3 未经书面同意，不得对本服务进行反向工程、反向编译或破解。</p>

          <h3>五、其它</h3>
          <p>7.1 本条款因与中华人民共和国现行法律相抵触而导致部分无效，不影响其他部分的效力。双方同意，解决争议时，应以您同意的最新版《白小喵用户协议》为准。
            7.2 如就本协议内容或其执行发生任何争议，应尽量友好协商解决；协商不成时，则争议各方均一致同意将争议提交北京仲裁委员会按照其仲裁规则进行仲裁。仲裁裁决为一裁终局，对各方均有法律约束力。
            7.3 为免疑义，除另有相反书面约定外，本条法律适用和管辖条款效力及于本协议及其他白小喵AI规则，包括其修订、补充及更新。
            7.4 如果您对本协议有任何疑问，请发送邮件到我们的邮箱: </p>



          <p>深圳光启科技有限公司</p>
          <p>2023年3月</p>
        </article>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
const router = useRouter();

const goBack = () => {
  router.go(-1);
}
</script>

<style scoped>
.article{
  --at-apply: px-2.4rem py-2.4rem font-400 text-12px line-height-16px;
}
.article > h3 {
  --at-apply: font-600 text-14px line-height-16px;
}
</style>